app/views/article/index.html.erb

SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 1  ORDER BY "articles"."created_at" DESC
---

        <% @category.articles.each do |article| %>