app/controllers/article_controller.rb

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 1  ORDER BY "articles"."created_at" DESC
---
  def index
  	@category = Category.find(params[:id])
    @articles = @category.articles.order(id: :desc)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "articles".* FROM "articles"  WHERE "articles"."category_id" = 1 LIMIT 5
---
  def show
  	@article = Article.find(params[:id])
    @articles = Article.where(category_id: @article.category_id).limit(5)