app/controllers/category_controller.rb

SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 1  ORDER BY "articles"."created_at" DESC
---
  def food
  	@articles = Article.where(category_id: '1')

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
---
  def food_article
  	@article = Article.find(params[:id])

SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 2  ORDER BY "articles"."created_at" DESC
---
  def shop
  	@articles = Article.where(category_id: '2')

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 4]]
---
  def shop_article
  	@article = Article.find(params[:id])

SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 3  ORDER BY "articles"."created_at" DESC
---
  def enjoy
  	@articles = Article.where(category_id: '3')

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 5]]
---
  def enjoy_article
  	@article = Article.find(params[:id])

SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 4
---
  def stay
  	@articles = Article.where(category_id: '4')

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 5]]
---
  def stay_article
  	@article = Article.find(params[:id])

SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 6
---
  def meet
  	@articles = Article.where(category_id: '6')

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 8]]
---
  def meet_article
  	@article = Article.find(params[:id])

SELECT "articles".* FROM "articles"  WHERE "articles"."category_id" = 7  ORDER BY "articles"."created_at" DESC
---
  def column
  	@articles = Article.where(category_id: '7')

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 6]]
---
  def column_article
  	@article = Article.find(params[:id])