app/controllers/category_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."category_id" = 1 LIMIT 5
---
  def food_article
  	@article = Article.find(params[:id])
    @articles = Article.where(category_id: '1').limit(5)