app/controllers/colum_controller.rb

SELECT "articles".* FROM "articles"  WHERE "articles"."article_category" = 'colum'
---
  def index
  	@articles = Article.where(article_category: 'colum')