app/controllers/column_controller.rb

  def index
  	@articles = Article.where(category: 'column')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."category" = 'column'