app/controllers/eat_controller.rb

  def index
  	@articles = Article.where(article_category: 'eat')
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."article_category" = 'EAT' LIMIT 1