app/controllers/enjoy_controller.rb

  def index
  	@articles = Article.where(category: ['enjoy', 'spot'])
---
SELECT "articles".* FROM "articles"  WHERE "articles"."category" IN ('enjoyspot')