app/controllers/enjoy_controller.rb

SELECT "articles".* FROM "articles"  WHERE "articles"."article_category" = 'eat'
---
  def index
  	@articles = Article.where(article_category: 'enjoy')