app/controllers/food_controller.rb

  def index
  	@articles = Article.where(category: 'food')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."category" = 'food'