app/controllers/general_controller.rb

  def index
  	@articles = Article.where(category: 'general')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."category" = 'general'