app/controllers/home_controller.rb

SELECT  "articles".* FROM "articles"   ORDER BY "articles"."id" DESC LIMIT 5
---
  def index
  	@articles = Article.all.order(id: :desc)
  	@article_photo = Article.last