app/controllers/meet_controller.rb

  def index
  	@articles = Article.where(category: 'meet')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."category" = 'meet'