app/controllers/member_controller.rb

  def show
    @member = Member.find(params[:id])
    @articles = @member.articles.order(id: :desc)
---
SELECT  "members".* FROM "members"  WHERE "members"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]