app/controllers/other_controller.rb

  def index
  	@articles = Article.where(article_category: 'other')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."article_category" = 'other'