app/controllers/shop_controller.rb

SELECT "articles".* FROM "articles"  WHERE "articles"."category" = 'shop'
---
  def index
  	@articles = Article.where(category: 'shop')