app/controllers/shop_index_controller.rb

  def index
  	@shops = Shop.all
---
SELECT "shops".* FROM "shops"