app/controllers/shop_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."article_category" = 'SHOP' LIMIT 1
---
  def index
  	@articles = Article.where(article_category: 'shop')