app/controllers/spot_controller.rb

SELECT "articles".* FROM "articles"  WHERE "articles"."article_category" = 'spot'
---
  def index
  	@articles = Article.where(article_category: 'spot')