app/controllers/stay_controller.rb

  def index
  	@articles = Article.where(category: 'stay')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."category" = 'stay'