app/controllers/study_controller.rb

  def index
  	@articles = Article.where(category: 'study')
---
SELECT "articles".* FROM "articles"  WHERE "articles"."category" = 'study'